docs/leets/0650-2-Keys-Keyboard.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-01-11 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>0650. 2 Keys Keyboard</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 2024-08-19
</div>
<div id="content" class="content">
<header>
<h1 class="title">0650. 2 Keys Keyboard</h1>
<p class="subtitle" role="doc-subtitle">leetcode</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org06d86d2">Problem</a></li>
<li><a href="#org728d224">Solution Description</a></li>
<li><a href="#orgb1fdd8a">Example</a></li>
<li><a href="#org4959247">References</a></li>
<li><a href="#org8e66306">Solution</a></li>
</ul>
</div>
</nav>


<div id="outline-container-org06d86d2" class="outline-2">
<h2 id="org06d86d2">Problem</h2>
<div class="outline-text-2" id="text-org06d86d2">
<p>
Given a single character 'A' initially displayed on a notepad, you can perform two operations on this notepad for any number of times:
</p>

<ol class="org-ol">
<li>Copy All: You can copy all the characters present on the notepad (partial or entire).</li>
<li>Paste: You can paste the characters which are copied last to the notepad.</li>
</ol>

<p>
Now, you are given an integer n, which represents the target number of 'A' characters. You need to find the minimum number of operations needed to get exactly n 'A' on the notepad.
</p>
</div>
</div>

<div id="outline-container-org728d224" class="outline-2">
<h2 id="org728d224">Solution Description</h2>
<div class="outline-text-2" id="text-org728d224">
<p>
To implement a solution, we need to use dynamic programming to break down the problem into smaller subproblems. We maintain an array where dp[i] represents the minimum number of operations required to get exactly i 'A's. We initialize dp[1] to 0 since no operations are needed to have one 'A'. For each number of 'A's, we try to find a divisor j which divides i. If j is a divisor, then the only way to produce i 'A's is by copying all from dp[j] and pasting (i/j) - 1 times.
</p>

<p>
The time complexity of this approach is O(n log n) because for each number from 2 to n, we check for its divisors. The space complexity is O(n) due to the dp array.
</p>
</div>
</div>

<div id="outline-container-orgb1fdd8a" class="outline-2">
<h2 id="orgb1fdd8a">Example</h2>
<div class="outline-text-2" id="text-orgb1fdd8a">
<p>
Let's take n = 4:
dp[1] = 0  (Initial 'A')
dp[2] = 2  (Copy -&gt; Paste)
dp[3] = 3  (Copy -&gt; Paste -&gt; Paste)
dp[4] = 4  (Copy -&gt; Paste -&gt; Copy -&gt; Paste)
</p>
</div>
</div>

<div id="outline-container-org4959247" class="outline-2">
<h2 id="org4959247">References</h2>
<div class="outline-text-2" id="text-org4959247">
<ul class="org-ul">
<li>Dynamic Programming: <a href="https://en.wikipedia.org/wiki/Dynamic_programming">https://en.wikipedia.org/wiki/Dynamic_programming</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8e66306" class="outline-2">
<h2 id="org8e66306">Solution</h2>
<div class="outline-text-2" id="text-org8e66306">
<div class="org-src-container">
<pre class="src src-js">/**
 * @param {number} n - The target number of 'A' characters.
 * @return {number} - The minimum number of operations needed to achieve n 'A' characters.
 */
function minSteps(n) {
    const dp = new Array(n + 1).fill(0);

    return dp[n];
}

// Test cases
const testCases = [
    { input: 1, expected: 0 },
    { input: 3, expected: 3 },
    { input: 4, expected: 4 },
    { input: 5, expected: 5 },
    { input: 9, expected: 6 }
];

testCases.forEach((test, index) =&gt; {
    const result = minSteps(test.input);
    console.log(`Test Case ${index + 1}: ${result === test.expected ? 'Passed' : 'Failed'} (Expected: ${test.expected}, Got: ${result})`);
});
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
